[
  {
    "content": "<p>Bhai. All that matters is your problem solving skills. Without that, nothing matters. People should join some low leve startup do some extensive work for a year or two, then slowly climb the ladder after they understand. <strong style=\"font-weight: 550;  color: blue; \"> Those who are getting into amazon google or Microsoft as a fresher, take it in writing from me, they would have 100% worked in some kind of internship before.</strong></p>"
  },
  {
    "content": "<p>The market is extremely bad for everyone right now, especially entry level people. Plus you went to a bootcamp, so everyone with a bachelors degree is more qualified than you and will get hired over you. <strong style=\"font-weight: 550;\"> The time where people can just go to a bootcamp, throw a few skills on a resume and get hired is over.</strong> Very few companies hire bootcamp grads, so you’re going to have to work extremely hard.</p>"
  },
  {
    "content": "<p>The start is tough right now. If you can hold on and get to one year experience it gets easier.</p>"
  },
  {
    "content": "<p>All the Leetcode you have been grinding will help you in at most 5% of your real work outside of interviews</p>"
  },
  {
    "content": "<h2 style=\"margin-bottom: 14px;\">Well from my understanding this happened:</h2> <ul><li style=\"margin-left: 14px;\">• Companies with low UX maturity hired bootcampers with no real experience. when they realised that these employees had no value, they were the first to go </li> <li style=\"margin-left: 14px;\">•  Companies are going lean so instead of hiring a UX Writer a UX Researcher an Interaction Designer and a UX architect, you can just get a UX Generalist. People with no design background that specialised on fields like research, writting etc where the first to go. </li> <li style=\"margin-left: 14px;\">• Senior Designers leveraged the high demand of UX Designers during the pandemic and inflated their salaries, making them easy targets to cut out when you need to save money.</li> <li style=\"margin-left: 14px;\">• Overhiring led to hiring many people with no real background to UX ( no a coursera or a google course doesn't make you a UX designer).</li> <li style=\"margin-bottom: 14px; margin-left: 14px;\">•  The market is correcting, salaries are correcting. The designers with real background, experience and education were rehired on the spot from other companies. Any one else that struggle to prove what they can bring was left behind.</li> </ul><p>This hurts juniors the most as the entry to the market is getting harder and harder. But do not forget that we live in an era where we have one of the highest number of UX designer and job positions. The industry is growing. Just because you got sold to the bootcamp idea and didn't make it, doesn't mean its the market's fault </p>"
  },
  {
    "content": "<p>The problem is that after completing certification courses and boot camps people call themselves designer and live in illusion of getting hired with a good salary </p>"
  },
  {
    "content": "<p>Nah the cost of living has increased exponentially here and the university's have increased the fees on top of it there are actually no jobs for students let alone for immigrants . Most of the kids who come to Canada aren't coming for star courses what would yield them good jobs or employment. you have masses coming for easy diplomas or language courses and MBA the goal is not higher education but citizenship . Most of these kids are average or below average students and their stupid degrees don't yield them anything even if they come back to India . Overpriced graduation and diplomas just to work as a waiter , drivers ,construction worker ,salesman or security personal . After you finish your degree you just work here as a glorified majdur Social media has hyped up studying abroad more or so people open lifestyle pages showing how everything abroad is perfect . In reality it's far from even an ideal life in India. Unless you aren't a rich brat living off money sent by your parents from India.</p>"
  },
  {
    "content": "<h2 style=\"margin-bottom: 11px;\"><strong style=\"font-weight: 550;\"> Senior Product Designer gave me some reality check:</strong></h2><p style=\"margin-bottom: 14px;\">Hey there,</p><p style=\"margin-bottom: 14px;\">I'll be honest with you right away and tell you that despite the apparent bright lights and flashy presentations, UI/UX as a career choice in India right now is a struggle, and not the good kind.</p><p style=\"margin-bottom: 14px;\">Most product design jobs at startups exist because PMs need someone to make the things they've already decided. Most product design jobs at larger companies give you tiny pieces of work, so abstracted and broken down that you're not owning the problem solving process.</p><p style=\"margin-bottom: 14px;\">There are some free resources on YouTube from NN group etc which teach you good skills in design processes and frameworks other than UI, like how to make diff types of journey maps, empathy maps etc. But a lot of these things are learned through practice and a change in one's pov; looking at EVERYTHING as a design problem/case study.</p><p style=\"border-left: 3px solid #8a2be2; padding-left: 10px;\">A good problem solver is by default an entrepreneur, and an entrepreneur thinks backwards from what's good for business vs what's good for 'theatrics'. Developing a basic level of business acumen, and applying design tools to solving business problems(all without opening Figma, yet) is a great way to become a better problem solver.</p>"
  },
  {
    "content": "<p style=\"margin-bottom: 14px;\">I'll tell you something about economics</p><p style=\"margin-bottom: 14px;\">Gone are the days where students would get placed 20-30 LPA+, why? Interest rates, US followed a 0% interest rate policy, so orgs would borrow and spend on hirings and a lot more, US is moving away from that policy now, it has resulted in immense inflation, to curb all that inflation, they've decided to not go back to that policy, hence less money in the market, less jobs and low pay, hence less inflation as well. The entire world is affected when US does it and every country increases or decreases their rates when US does. </p><p style=\"margin-bottom: 14px;\">They won't be drastically cutting rates for another couple of years, so it's better to get a job now, build some experience and switch after a couple of years for a high pay.</p><p>Don't let go of a single opportunity.</p>"
  },
  {
    "content": "<p> However, it's true that someone who has made actual projects earlier is much more likely to be better at working with production level code than someone doing just leetcode.</p>"
  },
  {
    "content": "<p>Development is neither about DSA nor \"Real projects\". It's about problem solving. It's about how you are able to solve bigger and newer problems. Whichever way you keep getting yourself uncomfortable is the best way. If your project is to build a physics engine for the game you are building then no amount of DSA would help you get that experience. But if you keep building the same projects inside your comfort zone then it's going to be hard. Similarly if you keep solving DSA problems which you are already comfortable in then you're not getting better</p>"
  },
  {
    "content": "No matter how many problems you solve on the leetcode, you always stuck while building real projects because these two are different skill set."
  },
  {
    "content": "<p style=\"margin-bottom: 14px;\">FAANG interviews main streamed the DS algos</p><p style=\"margin-bottom: 14px;\">Knowing how to develop an applications and ship features to production needs to be given equal importance.</p><p>In my previous firm I've worked/led freshers from tier 1 colleges, none of them knew how to ship a feature they just coded, committed the code and would think that their work is done.</p>"
  },
  {
    "content": "<p style=\"margin-bottom: 14px;\">As someone who's been in the industry for almost 8 years now, conducted interviews, mentored interns, and served as a tech lead who created enterprise web/native apps for a multi-billion dollar company -<strong style=\"font-weight: 550;\"> leetcode skills are just a tiny part of what a company wants.</strong></p><p style=\"margin-bottom: 14px;\">All of the interns I've met who talk about leetcode seem to think it's like a scoreboard. It's not at all. <strong style=\"font-weight: 550;\">Do not waste too much time on sites like</strong> that and I'll offer why as an interviewer it doesn't mean much.</p><p style=\"margin-bottom: 14px;\">Writing functions that are performant, clean, and eloquent are really good traits to have. That is a good skill to hone and to be proud of, but it's one of many traits I want to see some understanding of. In my experience, writing code is less than 50% of my job. Most of the time I'm in meetings, having technical discussions, designing systems, reviewing documentation, troubleshooting, writing emails, etc.</p><h2>Here's a concise list of what I want as an interviewer:</h2> <ul><li style=\"margin-left: 14px;\">• Technical understanding / skills</li> <li style=\"margin-left: 14px;\">•  Previous experience with tech stack languages/frameworks/libraries </li> <li style=\"margin-left: 14px;\">• Willingness to learn</li> <li style=\"margin-left: 14px;\">• Personal or community projects</li> <li style=\"margin-left: 14px;\">•  Soft skills*</li><li style=\"margin-left: 14px;\">•  How you perform under pressure</li><li style=\"margin-bottom: 14px; margin-left: 14px;\">•  Troubleshooting skills</li> </ul><p>Soft skills are super important. No one wants to work with someone who always thinks they're right or braggadocios/arrogant/pompous. I'm looking for humility, if you fuck up it's okay but how well do you move on from it and learn from it? Basically it all boils down to, as a person, can I enjoy working with you? Forget the code, and remember the human- I want to work with a person I value as a person and a coworker. Don't forget how important the culture fit aspect is. If I'm interviewing an absolute genius but the person's a prick, there's a very good chance they're not getting the job.</p>"
  },
  {
    "content": "<p style=\"margin-bottom: 14px;\">This damn \"bhaiyas\" and \"didis\" made a new JEE/NEET type rat race.</p><p style=\"margin-bottom: 14px;\">\"DSA kro Google me jaoo\" , \"DSA nhi kraa toh kya kraa\" \"Leetcode 500+ nhi h toh kuch nhi h\"</p><p style=\"margin-bottom: 14px;\">\"Why am I doing DSA? Who tf cares , bhaiya/didi told to solve this sheet and get placed in google/amazon.\"</p><p style=\"margin-bottom: 14px;\">\"Is grinding DSA helping me to learn anything? Who tf cares about learning, i am going to just solve the sheets, if i can't solve the question i will watch the bhaiya/didi playlist and mug up the brute force and optimal solutions and will clear the faaaaaaaaaannnngggg interview.\"</p><p style=\"margin-bottom: 14px;\">\"Hello, connections today i completed my 100 days streak in leetcode; hello connections i became a knight in leetcode although i don't know shit about CS fundamentals but i will grind leetcode by mugging up solutions instead of learning because bhaiya/didi said that ki leetcode 1000 krlo life set h, even though i can't solve the question i will copy the solution from somewhere else and spam it in the leetcode discussion panel as 'java 100% full faast solution/c+++ solution full fast O(n)\"</p><p style=\"margin-bottom: 14px;\">The students in CS/IT are like this then you can imagine about non-CS students.</p><p style=\"margin-bottom: 14px;\">My batch is filled with these \"leet-in my ass-coders\". Who don't know and neither want to explore various CS domains.</p><p style=\"margin-bottom: 14px;\">I am not saying that solving algorithms is bad, it is good if you enjoy it and actually learn something from it.</p><p>It is bad when you just do something because some bhaiya/didi told you so. Everyone is different, not every one will get into FAANG, identify what you are and what you like.<p/>"
  }
]
